---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InsertJoinedWall
source: html/f0b21b56-7868-cb17-6436-23adc86199d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InsertJoinedWall Property

Insert conflicts with joined Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId InsertJoinedWall { get; }
```